app/controllers/buildings_controller.rb

  def index
    @buildings = Building.all
---
SELECT "buildings".* FROM "buildings"

  def create
    @building = Building.new(building_params)

    respond_to do |format|
      if @building.save
---
INSERT INTO "buildings" ("id", "name", "address", "phone", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["id", 1], ["name", "Flatiiron"], ["address", "Tribeca"], ["phone", "1234567"], ["created_at", "2023-07-28 20:44:40.909864"], ["updated_at", "2023-07-28 20:44:40.909864"]]

  def destroy
    @building.destroy
---
DELETE FROM "buildings" WHERE "buildings"."id" = ?  [["id", 3]]

    def set_building
      @building = Building.find(params[:id])
---
SELECT "buildings".* FROM "buildings" WHERE "buildings"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]