app/controllers/engineers_controller.rb

  def index
    @engineers = Engineer.all
---
SELECT "engineers".* FROM "engineers"

  def create
    @engineer = Engineer.new(engineer_params)

    respond_to do |format|
      if @engineer.save
---
INSERT INTO "engineers" ("first_name", "last_name", "phone", "email", "building_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

    def set_engineer
      @engineer = Engineer.find(params[:id])
---
SELECT "engineers".* FROM "engineers" WHERE "engineers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]