app/controllers/maintenance_requests_controller.rb

SELECT "maintenance_requests".* FROM "maintenance_requests"
---
  def index
    @maintenance_requests = MaintenanceRequest.all

INSERT INTO "maintenance_requests" ("tenant_id", "requestinfo", "requestDate", "completed", "comment", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @maintenance_request = MaintenanceRequest.new(maintenance_request_params)

    respond_to do |format|
      if @maintenance_request.save

UPDATE "maintenance_requests" SET "completed" = ?, "comment" = ?, "updated_at" = ? WHERE "maintenance_requests"."id" = ?  [["completed", 1], ["comment", "Job is done!"], ["updated_at", "2023-08-07 21:22:33.369269"], ["id", 18]]
---
  def update
    respond_to do |format|
      if @maintenance_request.update(maintenance_request_params)

DELETE FROM "maintenance_requests" WHERE "maintenance_requests"."id" = ?  [["id", 3]]
---
  def destroy
    @maintenance_request.destroy

SELECT "maintenance_requests".* FROM "maintenance_requests" WHERE "maintenance_requests"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_maintenance_request
      @maintenance_request = MaintenanceRequest.find(params[:id])