app/controllers/managers_controller.rb

  def index
    @managers = Manager.all
---
SELECT "managers".* FROM "managers"

  def create
    @manager = Manager.new(manager_params)

    respond_to do |format|
      if @manager.save
---
INSERT INTO "managers" ("first_name", "last_name", "phone", "email", "Building_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

    def set_manager
      @manager = Manager.find(params[:id])
---
SELECT "managers".* FROM "managers" WHERE "managers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]