app/controllers/tenants_controller.rb

  def index
    @tenants = Tenant.all
---
SELECT "tenants".* FROM "tenants"

  def create
    @tenant = Tenant.new(tenant_params)

    respond_to do |format|
      if @tenant.save
---
INSERT INTO "tenants" ("first_name", "last_name", "apartment_no", "phone", "email", "created_at", "updated_at", "building_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @tenant.update(tenant_params)
---
UPDATE "tenants" SET "apartment_no" = ?, "updated_at" = ? WHERE "tenants"."id" = ?  [["apartment_no", "553"], ["updated_at", "2023-08-07 20:05:55.768044"], ["id", 11]]

  def destroy
    @tenant.destroy
---
DELETE FROM "tenants" WHERE "tenants"."id" = ?  [["id", 14]]

    def set_tenant
      @tenant = Tenant.find(params[:id])
---
SELECT "tenants".* FROM "tenants" WHERE "tenants"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]